In [1]:
import pandas as pd
from datetime import datetime

# Tworzymy pusty DataFrame z odpowiednimi kolumnami
kolumny = [
    "produkt",
    "ilość",
    "kcal_na_szt",
    "kcal_razem",
    "cena_na_szt",
    "cena_razem",
    "łączna kwota za paragon",
    "data",
    "miasto",
    "ulica"
]

fake_df = pd.DataFrame(columns=kolumny)
fake_df

Empty DataFrame
Columns: [produkt, ilość, kcal_na_szt, kcal_razem, cena_na_szt, cena_razem, łączna kwota za paragon, data, miasto, ulica]
Index: []

In [2]:

fake_df = pd.read_csv("fake_df.csv")
fake_df

,produkt,ilość,kcal_na_szt,kcal_razem,cena_na_szt,cena_razem,łączna kwota za paragon,data,miasto,ulica
0,Cheeseburger,1,306,306,5.1,5.1,20.5,2025-02-15 14:15,Warszawa,Górczewska 249
1,McChicken,1,443,443,11.2,11.2,20.5,2025-02-15 14:15,Warszawa,Górczewska 249
2,Frytki Małe,1,229,229,4.2,4.2,20.5,2025-02-15 14:15,Warszawa,Górczewska 249

In [8]:
nowy_rekord = {
    "produkt": "Frytki Małe",
    "ilość": 1,
    "kcal_na_szt": 229,
    "kcal_razem": 229,
    "cena_na_szt": 4.2,
    "cena_razem": 4.2,
    "łączna kwota za paragon": 20.5,  # np. suma z paragonu
    "data": '2025-02-15 14:15',
    "miasto": "Warszawa",
    "ulica": "Górczewska 249"
}

# Dodajemy rekord do DataFrame
fake_df = pd.concat([fake_df, pd.DataFrame([nowy_rekord])], ignore_index=True)

fake_df

,produkt,ilość,kcal_na_szt,kcal_razem,cena_na_szt,cena_razem,łączna kwota za paragon,data,miasto,ulica
0,Cheeseburger,1,306,306,5.1,5.1,20.5,2025-02-15 14:15,Warszawa,Górczewska 249
1,McChicken,1,443,443,11.2,11.2,20.5,2025-02-15 14:15,Warszawa,Górczewska 249
2,Frytki Małe,1,229,229,4.2,4.2,20.5,2025-02-15 14:15,Warszawa,Górczewska 249

In [9]:
fake_df.to_csv("fake_df.csv", index=False, encoding="utf-8")